Repository: GonzaGarcia01914/myWebsite
Catalog: lib/l10n/app_*.arb
Languages: es

# navProjects
source: Projects
es: Proyectos

# navResume
source: Resume
es: Currículum

# navContact
source: Contact
es: Contacto

# sectionProjects
source: Projects
es: Proyectos

# sectionResume
source: Resume
es: Currículum

# sectionContact
source: Contact
es: Contacto

# heroDescription
source: Software developer with 4 years of experience in Flutter, cloud services, and Generative AI. I design and ship fast, accessible mobile apps, integrating LLMs and end-to-end automations. Obsessed with measuring, optimizing, and scaling without drama.
es: Desarrollador de software con 4 años de experiencia en Flutter, servicios cloud e IA Generativa. Diseño y lanzo aplicaciones móviles rápidas y accesibles, integrando LLMs y automatizaciones end-to-end. Mi obsesión: medir, optimizar y escalar sin complicaciones.

# resumeMySkills
source: My skills
es: Mis habilidades

# resumeExperience
source: Experience
es: Experiencia

# resumeDownloadCv
source: Download CV (PDF)
es: Descargar CV (PDF)

# tabCode
source: Code
es: Código

# tabDescription
source: Description
es: Descripción

# btnOpenGithub
source: Check it on GitHub!
es: Ver en GitHub

# tooltipClose
source: Close
es: Cerrar

# codeViewerMissing
source: No code viewer configured.
es: No hay visor de código configurado.

# btnOpenOnGithub
source: Open on GitHub
es: Abrir en GitHub

# demoBanner
source: Keep in mind that this project was designed for mobile devices; this is a representative web demo.
es: Ten en cuenta que este proyecto fue diseñado para móviles; esta es una demo web representativa.

# contactPhone
source: Phone
es: Teléfono

# contactTapToOpen
source: Tap to open
es: Toca para abrir

# exp1Bullet1
source: Built Flutter apps integrated with Google Cloud AI solutions.
es: Desarrollé aplicaciones Flutter integradas con soluciones de IA de Google Cloud.

# exp1Bullet2
source: Focused on UX, performance and end‑to‑end traceability.
es: Me enfoqué en UX, rendimiento y trazabilidad end-to-end.

# exp2Bullet1
source: Diagnosed and resolved platform issues (networking, certificates).
es: Diagnostiqué y resolví issues complejos de plataforma (networking, certificados).

# exp2Bullet2
source: Improved reliability and response times.
es: Contribuí a mejorar la fiabilidad y los tiempos de respuesta.

# exp3Bullet1
source: Developed cross‑platform apps with Flutter/Dart.
es: Desarrollé aplicaciones multiplataforma con Flutter/Dart.

# exp3Bullet2
source: Integrated services and applied sound architecture practices.
es: Integré servicios y apliqué principios de arquitectura limpia.

# summaryPortfolio
source: Web portfolio (Flutter Web) with section navigation and a projects modal. Each project includes an embedded demo (with mobile/tablet frame), a GitHub‑backed code viewer, and a tag‑rich description. Animated UI with Material 3, responsive layout, keyboard/focus support and deployment on GitHub Pages.
es: Portafolio web (Flutter Web) con navegación por secciones y modal de proyectos. Cada proyecto incluye una demo embebida (con marco de móvil/tablet), un visor de código conectado a GitHub y una descripción enriquecida con etiquetas. UI animada con Material 3, diseño responsive, soporte de foco/teclado y despliegue en GitHub Pages.

# summaryMovies
source: Mobile app to explore TMDb content (now playing, popular, search, details, cast and recommendations). Uses a Firebase Cloud Functions proxy to secure API keys and serve data, showcasing clean architecture, state management and production‑grade integration.
es: Aplicación móvil para explorar contenido de TMDb (cartelera, populares, búsqueda, detalles, reparto y recomendaciones). Utiliza un proxy en Firebase Cloud Functions para proteger las claves y servir datos, demostrando arquitectura limpia, gestión de estado e integración de nivel producción.

# summaryMestura
source: AI cooking assistant that generates recipes from ingredients or cravings. Adjust servings, time and skill level; respects diets and restrictions. Includes step‑by‑step cooking mode with timers, offline favorites + shopping list, deep links and multi‑language support. Monetized with spaced interstitial ads.
es: Asistente de cocina con IA que genera recetas a partir de ingredientes o antojos. Permite ajustar raciones, tiempo y nivel de habilidad; respeta dietas y restricciones. Incluye un modo paso a paso con temporizadores, favoritos offline, lista de la compra, deep links y soporte multidioma. Monetización con anuncios intersticiales espaciados.

# exp1Desc
source: As Generative AI Subject Matter Expert (SME) at Cognizant within the Google Cloud project, I led the development of Flutter applications integrating Google Cloud’s AI solutions. My role focused on delivering innovative client experiences by combining advanced AI capabilities with intuitive UX. I also ensured high performance and full end-to-end traceability across the applications.
es: Como SME (Subject Matter Expert) en IA Generativa en Cognizant, dentro del proyecto de Google Cloud, lideré el desarrollo de aplicaciones Flutter integradas con soluciones de IA de Google Cloud. Mi trabajo se centró en ofrecer experiencias innovadoras a los clientes, combinando capacidades avanzadas de IA con una UX intuitiva. Además, aseguré alto rendimiento y trazabilidad end-to-end en todas las aplicaciones.

# exp2Desc
source: During my time with Microsoft Azure App Services (through LTIMindtree), I worked on diagnosing and resolving complex platform and software issues, with an emphasis on networking and certificates. I contributed to improving service reliability, reducing response times, and ensuring seamless operation of critical cloud services for enterprise clients.
es: Durante mi etapa en Microsoft Azure App Services (a través de LTIMindtree), trabajé en el diagnóstico y resolución de incidencias complejas de plataforma y software, principalmente relacionadas con networking y certificados. Contribuí a mejorar la fiabilidad de los servicios, reducir los tiempos de respuesta y garantizar la operación continua de servicios cloud críticos para clientes empresariales.

# exp3Desc
source: I participated in the development of cross-platform applications using Flutter and Dart, with a strong focus on clean architecture principles. My responsibilities included integrating third-party services, designing maintainable code structures, and ensuring scalability. These projects strengthened my ability to deliver robust, user-centered mobile and web applications.
es: Participé en el desarrollo de aplicaciones multiplataforma con Flutter y Dart, aplicando principios de arquitectura limpia. Mis responsabilidades incluyeron integrar servicios de terceros, diseñar estructuras de código mantenibles y asegurar la escalabilidad. Estos proyectos reforzaron mi capacidad de entregar aplicaciones móviles y web robustas, centradas en el usuario.

# projectMoviesSubtitle
source: TMDb explorer, favorites and cache; Firebase Functions proxy backend.
es: Explorador TMDb, favoritos y caché; proxy backend en Firebase Functions.

# projectMesturaTitle
source: Mestura – Your cooking AI assistant
es: Mestura – Tu asistente de cocina con IA

# projectMesturaSubtitle
source: AI‑powered assistant to generate and cook recipes.
es: Asistente con IA para generar y cocinar recetas.

# projectPortfolioTitle
source: This page was also made with Flutter!
es: ¡Esta página también fue hecha con Flutter!

# projectPortfolioSubtitle
source: This portfolio built with Flutter Web
es: Portfolio construido con Flutter Web
